////历届试题-回文数字
//问题描述
//　　观察数字：12321，123321 都有一个共同的特征，无论从左到右读还是从右向左读，都是相同的。这样的数字叫做：回文数字。
//
//　　本题要求你找到一些5位或6位的十进制数字。满足如下要求：
//　　该数字的各个数位之和等于输入的整数。
//输入格式
//　　一个正整数 n (10<n<100), 表示要求满足的数位和。
//输出格式
//　　若干行，每行包含一个满足要求的5位或6位整数。
//　　数字按从小到大的顺序排列。
//　　如果没有满足条件的，输出：-1
#include <iostream>
using namespace std;
int main() {
    int n;
    int flag = 0;
    cin >> n;
    for (int i1 = 1; i1 <= 9; i1++)
        for (int i2 = 0; i2 <= 9; i2++)
            for (int i3 = 0; i3 <= 9; i3++) {
                if ((i1 + i2 + i3 + i2 + i1) == n) {
                    flag = 1;
                    cout << i1 << i2 << i3 << i2 << i1 << endl;
                }
            }
    for (int i1 = 1; i1 <= 9; i1++)
        for (int i2 = 0; i2 <= 9; i2++)
            for (int i3 = 0; i3 <= 9; i3++) {
                if ((i1 + i2 + i3 + i3 + i2 + i1) == n) {
                    flag = 1;
                    cout << i1 << i2 << i3 << i3 << i2 << i1 << endl;
                }
            }
    if (flag == 0)
        cout << -1;
    return 0;
}
